tap "beeftornado/rmtree"
tap "buo/cask-upgrade"
tap "gapple/services"
tap "homebrew/bundle"
tap "homebrew/cask", "https://mirrors.ustc.edu.cn/homebrew-cask.git"
tap "homebrew/cask-fonts"
tap "homebrew/core", "https://mirrors.ustc.edu.cn/homebrew-core.git"
tap "homebrew/services"
tap "mongodb/brew"
tap "mvndaemon/mvnd"
brew "autojump"
brew "colima"
brew "docker"
brew "docker-compose"
brew "fish"
brew "fzf"
brew "go"
brew "lua"
brew "highlight"
brew "nginx", restart_service: true
brew "nvm"
brew "ranger"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "beeftornado/rmtree/brew-rmtree"
brew "mongodb/brew/mongodb-community-shell"
cask "adrive"
cask "alacritty"
cask "appcleaner"
cask "clashx"
cask "dbeaver-community"
cask "firefox"
cask "fleet"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "github"
cask "google-chrome"
cask "hiddenbar"
cask "iina"
cask "intellij-idea-ce"
cask "jclasslib-bytecode-viewer"
cask "jetbrains-toolbox"
cask "macrorecorder"
cask "maczip"
cask "microsoft-outlook"
cask "postman"
cask "raycast"
cask "rectangle"
cask "silicon"
cask "snipaste"
cask "sourcetree"
cask "sublime-text"
cask "visual-studio-code"
cask "vmware-fusion"
